# 对list的切片操作
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9]
print("原始列表:", my_list)

# 切片操作
print("\n切片操作结果:")
print("从头开始步长为1:", my_list[:])  # [1, 2, 3, 4, 5, 6, 7, 8, 9]
print("前3个元素:", my_list[:3])  # [1, 2, 3]
print("第2到第4个元素:", my_list[1:4])  # [2, 3, 4]
print("每隔一个取元素:", my_list[::2])  # [1, 3, 5, 7, 9]




# 对元组的切片操作
my_tuple = (1, 2, 3, 4, 5, 6, 7, 8, 9)
print("\n原始元组:", my_tuple)

# 切片操作
print("\n切片操作结果:")
print("倒序:", my_tuple[::-1])  # (1, 2, 3, 4, 5, 6, 7, 8, 9)
print("前3个元素:", my_tuple[:3])  # (1, 2, 3)
print("第2到第4个元素:", my_tuple[1:4])  # (2, 3, 4)
print("每隔一个取元素:", my_tuple[::2])  # (1, 3, 5, 7, 9)